[{"_template":"html","content":" <h5>Celebrate in style.</h5> <p> The Padre Hotel features multiple venues to accommodate your meeting or special occasion. </p><p> To learn more about how we can assist your company’s needs <a href='mailto:events@thepadrehotel.com' >please contact our corporate sales team for great Corporate Rates! </a></p><ul> <li>Full-Service Event Planning</li><li>Gourmet Catering</li><li>Audio & Video Services</li><li>Great Corporate Rates Available</li></ul> <p>For more information, please contact<a href='mailto:events@thepadrehotel.com'> events@thepadrehotel.com </a> call <a href='tel:8884433387'>888-GIDDE-UP(443-3387)</a></p><h5>WEDDINGS</h5> <p>Newly renovated, our multiple venues feature fresh design schemes, gourmet catering, and high-end amenities. We specialize in your most intimate events, including weddings, rehearsal dinners, bridal showers and even bachelor and bachelorette parties!Not sure where to spend your special night? Stay in one of our classic Honeymoon suites for the most romantic and memorable evening. Our professional staff will assist you in customizing the perfect package for your celebration.</p><h5>THE BOARD ROOM</h5> <p>10 Executive Seats, rich leather, walnut paneling and our best whiskey at your private bar. Includes wireless internet and flat screen for presentations. Get down to business, get the deal done, then close the laptop, plug in the iTunes and pour it.</p><h5>THE STAMPEDE ROOM</h5> <p>Bring the whole company. 80 seats, full bar, breakfast, lunch or dinner. Full multimedia available.</p><h5>THE FOX ROOM</h5> <p>Seating for 35. Have an executive retreat? Do you need to get the kin together? This rooms works great for both!</p><h5>THE FIRESIDE ROOM</h5> <p>Small and compact, but powerful. Some day you will need our biggest room, but for now you will fill our smallest. Enjoy seating for 25 as we take care of all your meeting and dining needs.</p><div class='col-md-12' > <div class='brown-button'> <a href='/request-for-proposal/' class='hover-transition'>REQUEST FOR PROPOSAL</a> </div></div>","rendered_height":500}]